Repository: IamSriKrishna/Ourzhop
Catalog: core/l10n/app_*.arb
Languages: ta

# loginScreenTitle
source: Login
ta: உள்நுழைய

# loginScreenSubtitle
source: Enter your mobile number
ta: உங்கள் மொபைல் எண்ணை உள்ளிடவும்

# mobileNumberLabel
source: Mobile Number
ta: மொபைல் எண்

# verifyButtonTitle
source: Verify
ta: சரிபார்க்கவும்

# generatingOtpTitle
source: Generating OTP...
ta: ஓடிபி உருவாக்கப்படுகிறது...

# loginErrorTitle
source: Login Error
ta: உள்நுழைவு பிழை

# phoneNumberValidationError
source: Please enter a valid 10-digit mobile number
ta: சரியான 10-இலக்க மொபைல் எண்ணை உள்ளிடவும்

# phoneNumberRequired
source: Phone number is required
ta: மொபைல் எண் தேவை

# phoneNumberTooShort
source: Phone number must be exactly 10 digits
ta: மொபைல் எண் சரியாக 10 இலக்கங்கள் இருக்க வேண்டும்

# phoneNumberTooLong
source: Phone number must be exactly 10 digits
ta: மொபைல் எண் சரியாக 10 இலக்கங்கள் இருக்க வேண்டும்

# phoneNumberInvalid
source: Phone number must contain only digits
ta: மொபைல் எண்ணில் இலக்கங்கள் மட்டுமே இருக்க வேண்டும்

# createButtonTitle
source: Create
ta: உருவாக்கு

# signinPageTitle
source: Signin
ta: உள்நுழைய

# signinButtonTitle
source: Sign In
ta: உள்நுழையவும்

# signinProgressSendingOtp
source: Send otp...
ta: ஓடிபி அனுப்பப்படுகிறது...

# verifyOtpPageTitle
source: Verification code
ta: ஓடிபி சரிபார்க்கவும்

# verifyOtpPageSubTitle
source: We have sent OTP code verification to your mobile no
ta: உங்கள் மொபைல் எண்ணிற்கு ஓடிபி அனுப்பப்பட்டுள்ளது

# verifyOtpEnterOtpHint
source: Enter OTP
ta: ஓடிபி உள்ளிடவும்

# verifyOtpButtonTitle
source: Verify
ta: ஓடிபி சரிபார்க்கவும்

# verifyOtpDidNotReceiveOtp
source: Didn't get OTP Code ?
ta: ஓடிபி கோட் கிடைக்கவில்லையா?

# verifyOtpResendCode
source: Resend Code
ta: மீண்டும் அனுப்பு

# verifyOtpProgressVerifying
source: Verifying OTP...
ta: ஓடிபி சரிபார்க்கப்படுகிறது...

# otpTitle
source: OTP
ta: ஓடிபி

# otpSubtitle
source: Enter the OTP sent to your number
ta: உங்கள் எண்ணிற்கு அனுப்பப்பட்ட ஓடிபியை உள்ளிடவும்

# resendButtonTitle
source: Resend
ta: மீண்டும் அனுப்பு

# signupPageTitle
source: Sign Up
ta: பதிவு செய்ய

# signupEnterNameHint
source: Enter Name
ta: பெயர் உள்ளிடவும்

# signupEnterEmailHint
source: Enter Email
ta: மின்னஞ்சல் உள்ளிடவும்

# signupEnterMobileHint
source: Enter Mobile
ta: மொபைல் எண்ணை உள்ளிடவும்

# signupButtonTitle
source: Sign Up
ta: பதிவு செய்யவும்

# signupProgressCreatingUser
source: Creating user...
ta: பயனர் உருவாக்கப்படுகிறார்...

# signupMobileExistsMessage
source: Mobile number already exists
ta: மொபைல் எண் ஏற்கனவே உள்ளது

# profilePageTitle
source: Profile
ta: சுயவிவரம்

# profileLogoutButtonTitle
source: Logout
ta: வெளியேறு

# profileProgressLogout
source: Logout...
ta: வெளியேறு...

# createHubPageTitle
source: Create Hub
ta: ஹப் உருவாக்கு

# createHubButtonTitle
source: Create
ta: உருவாக்கு

# editHubPageTitle
source: Edit Hub
ta: ஹப் திருத்து

# editHubHubIdLabel
source: Hub ID
ta: ஹப் ஐடி

# hubsPageTitle
source: Hubs
ta: ஹப்கள்

# hubsCreateHubButtonTitle
source: Create Hub
ta: ஹப் உருவாக்கு

# hubsEditHubButtonTitle
source: Edit Hub
ta: ஹப் திருத்து

# bottomNavHome
source: Home
ta: முகப்பு

# bottomNavCategories
source: Categories
ta: வகைகள்

# bottomNavCart
source: Cart
ta: கார்ட்

# usersPageTitle
source: Users
ta: பயனர்கள்

# usersNoUserMessage
source: No users!
ta: பயனர்கள் இல்லை!

# usersProgressCreating
source: Creating user...
ta: பயனர் உருவாக்கப்படுகிறார்...

# usersProgressDeleting
source: Deleting user...
ta: பயனர் அழிக்கப்படுகிறார்...

# usersProgressUpdating
source: Updating user...
ta: பயனர் புதுப்பிக்கப்படுகிறார்...

# usersSuccessfullyCreated
source: Successfully created
ta: வெற்றிகரமாக உருவாக்கப்பட்டது

# usersSuccessfullyDeleted
source: Successfully deleted
ta: வெற்றிகரமாக அழிக்கப்பட்டது

# usersSuccessfullyUpdated
source: Successfully updated
ta: வெற்றிகரமாக புதுப்பிக்கப்பட்டது

# carsPageTitle
source: Cars
ta: கார்கள்

# gettingLocationTitle
source: Getting your location...
ta: உங்கள் இருப்பிடம் கண்டறியப்படுகிறது...

# selectLocationTitle
source: Select location
ta: இருப்பிடத்தை தேர்ந்தெடுக்கவும்

# selectLocationSubtitle
source: Use current location or search your own location
ta: தற்போதைய இருப்பிடத்தை பயன்படுத்தவும் அல்லது உங்கள் சொந்த இருப்பிடத்தை தேடவும்

# noLocationsFound
source: No locations found for your search
ta: உங்கள் தேடலுக்கு எந்த இருப்பிடமும் கிடைக்கவில்லை

# searchLocationHint
source: Search for area, street...
ta: பகுதி, தெரு தேடவும்...

source: Use current location
ta: தற்போதைய இருப்பிடத்தை பயன்படுத்தவும்

source: Location detected
ta: இருப்பிடம் கண்டறியப்பட்டது

# locationPermissionNeeded
source: Need to give location permission
ta: இருப்பிட அனுமதி தேவை

# continueButtonTitle
source: Continue
ta: தொடரவும்

# locationPermissionRequired
source: Location permission is required to get your current location
ta: உங்கள் தற்போதைய இருப்பிடத்தைப் பெற இருப்பிட அனுமதி தேவை

# accountSetupPageTitle
source: Account setup
ta: கணக்கு அமைப்பு

# accountSetupPageSubTitle
source: Let's set up your account.
ta: உங்கள் கணக்கை அமைப்போம்.

# accountSetupName
source: Name
ta: பெயர்

# accountSetupEmail
source: Email
ta: மின்னஞ்சல்

# accountSetupButtonTitle
source: Continue
ta: தொடரவும்

# accountSetupNameHint
source: Enter Name
ta: பெயர் உள்ளிடவும்

# accountSetupEmailHint
source: Enter Email
ta: மின்னஞ்சல் உள்ளிடவும்

# accountSetupProgressVerifying
source: Account Setup Is Processing...
ta: கணக்கு அமைப்பு செயலாக்கப்படுகிறது...

# accountSetupNameRequired
source: Name is required
ta: பெயர் தேவை

# accountSetupEmailRequired
source: Email is required
ta: மின்னஞ்சல் தேவை

# accountSetupEmailInvalid
source: Please enter a valid email address
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்

# nameValidationEmpty
source: Name is required
ta: பெயர் தேவை

# nameValidationTooShort
source: Name must be at least 2 characters
ta: பெயர் குறைந்தது 2 எழுத்துகள் இருக்க வேண்டும்

# nameValidationTooLong
source: Name must be less than 50 characters
ta: பெயர் 50 எழுத்துகளுக்கு குறைவாக இருக்க வேண்டும்

# nameValidationInvalid
source: Name contains invalid characters
ta: பெயரில் தவறான எழுத்துகள் உள்ளன

# emailValidationEmpty
source: Email is required
ta: மின்னஞ்சல் தேவை

# emailValidationInvalid
source: Please enter a valid email address
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்

# emailValidationTooLong
source: Email is too long
ta: மின்னஞ்சல் மிக நீளமானது

# setLocationTitle
source: Set Your Location
ta: உங்கள் இருப்பிடத்தை அமைக்கவும்

# setLocationSubtitle
source: Search and select your preferred location
ta: உங்கள் விருப்பமான இருப்பிடத்தைத் தேடி தேர்ந்தெடுக்கவும்

# setLocationSearchHint
source: Search for area, street...
ta: பகுதி, தெரு தேடவும்...

# setLocationNoResults
source: No locations found for your search
ta: உங்கள் தேடலுக்கு இருப்பிடங்கள் எதுவும் கிடைக்கவில்லை

# setLocationSelectError
source: Please select a location to continue
ta: தொடர இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்

# setLocationSaveError
source: Failed to save location. Please try again.
ta: இருப்பிடத்தைச் சேமிக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# setLocationNavigationError
source: Navigation failed. Please try again.
ta: வழிசெலுத்தல் தோல்வியுற்றது. மீண்டும் முயற்சிக்கவும்.

# setLocationPageTitle
source: Select location
ta: இருப்பிடத்தைத் தேர்ந்தெடுக்கவும்

# setLocationPageSubtitle
source: Use current location or search your own location
ta: தற்போதைய இருப்பிடத்தைப் பயன்படுத்தவும் அல்லது உங்கள் சொந்த इருப்பிடத்தைத் தேடவும்

# setLocationEmptySearchError
source: Please enter a location
ta: இருப்பிடத்தை உள்ளிடவும்

# setLocationSearchTooShortError
source: Location search requires at least 3 characters
ta: இருப்பிட தேடலுக்கு குறைந்தது 3 எழுத்துகள் தேவை

# setLocationSearchTooLongError
source: Location search cannot exceed 100 characters
ta: இருப்பிட தேடல் 100 எழுத்துகளை மீற முடியாது

# setLocationInvalidSearchError
source: Please enter a valid location
ta: சரியான இருப்பிடத்தை உள்ளிடவும்

# categoriesPageTitle
source: Categories
ta: வகைகள்

# categoriesLoadingMessage
source: Loading categories...
ta: வகைகள் ஏற்றப்படுகிறது...

# categoriesLoadError
source: Failed to load categories
ta: வகைகளை ஏற்ற முடியவில்லை

# categoriesRetryButton
source: Retry
ta: மீண்டும் முயற்சிக்கவும்

# categoriesNoDataMessage
source: No categories available
ta: வகைகள் எதுவும் கிடைக்கவில்லை

# categoriesLoadMoreButton
source: Load More
ta: மேலும் ஏற்றவும்
